<!DOCTYPE html>
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>



<?

#Имена и породы
#Группы - Хозяева, имя животного и порода
#Хозяин несколько животных с именем и породой
#Передать животное от одного хозяина другому
#


$pets[0]['Вова']['животное 1']['NAME'] = "Муська";
$pets[0]['Вова']['животное 1']['BREED'] = "Британская кошка";
$pets[0]['Вова']['животное 2']['NAME'] = "Арчи";
$pets[0]['Вова']['животное 2']['BREED'] = "Персидская кошка";


$pets[0]['Ира']['животное 1']['NAME'] = "Юф";
$pets[0]['Ира']['животное 1']['BREED'] = "Стаффордширский бультерьер";
$pets[0]['Ира']['животное 2']['NAME'] = "Майкл";
$pets[0]['Ира']['животное 2']['BREED'] = "Бульдог";



$pets[0]['Слава'] = array( "животное 1"=> array("NAME"=>"Мурка", "BREED"=>"Русская голубая кошка"),
							"животное 2"=> array("NAME"=>"Вася", "BREED"=>"Русский полосатый"));


$pets[1]['Коля']['животное 1']['NAME'] = "Борис";
$pets[1]['Коля']['животное 1']['BREED'] = "Бельгийский короткошерстный";
$pets[1]['Коля']['животное 2']['NAME'] = "Алиса";
$pets[1]['Коля']['животное 2']['BREED'] = "Сиамская кошка";

$pets[1]['Маша']['животное 1']['NAME'] = "Фишер";
$pets[1]['Маша']['животное 1']['BREED'] = "Лабрадор";
$pets[1]['Маша']['животное 2']['NAME'] = "Вихрь";
$pets[1]['Маша']['животное 2']['BREED'] = "Сибирский хаски";

?>
<pre><? print_r($pets)?></pre>

<h1>Список животных</h1>
<? foreach($pets as $key=>$group){ ?>
	<div>
	<h1><?= $key ?></h1>
		<? foreach($group as $owner=>$pet){ ?>
			<h2><?= $owner ?></h2>
				<? foreach($pet as $ones=>$description) {?>
						<div><strong><?= $description['BREED'] ?></strong> - <?= $description['NAME'] ?></div>
				<?}?>
		<?}?>
	</div>
<?}?>




</body>
</html>

