<?
/** Домашнее задание

1. Добавить в массив 3х героев Марвел и 3х героев ВОВ
2. Вывести группы в 2 колонки
3. Вывести группы в сроку, а героев в 2 колонки
4. Добавить группу (Герои Советских мультфильмов) вторую группу всегда выводить красным
5. С помощью функций работы со строками убирать лишние пробелы и вставку %Цензура%
6. C помощью функций работы со строками - сначала Имя и Отчество, затем фамилия.

**/

$arData = array('0' => array('groupName' => "Герои Marvel",
 							  'items' => array()
 							),
				 '1' => array('groupName' => "Герои ВОВ",
 							  'items' => array()
 							)


				);

?>